Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-Ontologies",
                          - "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-Descendants",
                          - "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-Anscestors",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getRuns"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:6",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8900097994545385591" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1751848838863625000" -> "1753950621484746000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-indexer.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/sbeacon-backend-indexer"
        name              = "/aws/lambda/sbeacon-backend-indexer"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-indexer.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "sbeacon-backend-indexer"
        name                  = "sbeacon-backend-indexer"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-indexer.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-indexer:sbeacon-backend-indexer-0"
        name        = "sbeacon-backend-indexer-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "athena:StartQueryExecution",
                          - "athena:GetQueryResults",
                          - "athena:GetQueryExecution",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:athena:ap-southeast-3:460722568061:workgroup/query_workgroup"
                    },
                  - {
                      - Action   = "glue:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gasi-metadata-20250513021731641000000004/*",
                          - "arn:aws:s3:::gasi-metadata-20250513021731641000000004",
                        ]
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-project-users/index/uid-index"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-indexer.aws_iam_role_policy.additional_jsons[1] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-indexer:sbeacon-backend-indexer-1"
        name        = "sbeacon-backend-indexer-1"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-Ontologies",
                          - "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-Descendants",
                          - "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-Anscestors",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-indexer.aws_iam_role_policy.additional_jsons[2] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-indexer:sbeacon-backend-indexer-2"
        name        = "sbeacon-backend-indexer-2"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:BatchWriteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-Ontologies",
                          - "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-Descendants",
                          - "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-Anscestors",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-indexer.aws_iam_role_policy.additional_jsons[3] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-indexer:sbeacon-backend-indexer-3"
        name        = "sbeacon-backend-indexer-3"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:BatchWriteItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-mutex-locks"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-indexer"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:6",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4207999587174035855" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1747810730202281000" -> "1753950622645337200"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-performQuery.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/sbeacon-backend-performQuery"
        name              = "/aws/lambda/sbeacon-backend-performQuery"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-performQuery.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "sbeacon-backend-performQuery"
        name                  = "sbeacon-backend-performQuery"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-performQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer:5",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:6",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6104329110911941749" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1742792307818556000" -> "1753950622847334000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-splitQuery.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/sbeacon-backend-splitQuery"
        name              = "/aws/lambda/sbeacon-backend-splitQuery"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-splitQuery.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "sbeacon-backend-splitQuery"
        name                  = "sbeacon-backend-splitQuery"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-splitQuery.aws_iam_role_policy.additional_json[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_json" {
        id          = "sbeacon-backend-splitQuery:sbeacon-backend-splitQuery"
        name        = "sbeacon-backend-splitQuery"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:460722568061:function:sbeacon-backend-performQuery"
                    },
                  - {
                      - Action   = "SNS:Publish"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sns:ap-southeast-3:460722568061:performQuery"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-splitQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:6",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6592849877617116191" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1742792308237397000" -> "1753950623098339000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-submitDataset.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/sbeacon-backend-submitDataset"
        name              = "/aws/lambda/sbeacon-backend-submitDataset"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-submitDataset.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "sbeacon-backend-submitDataset"
        name                  = "sbeacon-backend-submitDataset"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-submitDataset.aws_iam_role_policy.additional_jsons[1] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-submitDataset:sbeacon-backend-submitDataset-1"
        name        = "sbeacon-backend-submitDataset-1"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "athena:StartQueryExecution",
                          - "athena:GetQueryResults",
                          - "athena:GetQueryExecution",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:athena:ap-southeast-3:460722568061:workgroup/query_workgroup"
                    },
                  - {
                      - Action   = "glue:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gasi-metadata-20250513021731641000000004/*",
                          - "arn:aws:s3:::gasi-metadata-20250513021731641000000004",
                        ]
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-project-users/index/uid-index"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-submitDataset.aws_iam_role_policy.additional_jsons[2] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-submitDataset:sbeacon-backend-submitDataset-2"
        name        = "sbeacon-backend-submitDataset-2"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-Ontologies",
                          - "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-Descendants",
                          - "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-Anscestors",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-submitDataset.aws_iam_role_policy.additional_jsons[3] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-submitDataset:sbeacon-backend-submitDataset-3"
        name        = "sbeacon-backend-submitDataset-3"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:BatchWriteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-Ontologies",
                          - "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-Descendants",
                          - "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-Anscestors",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-submitDataset.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-submitDataset"
      ~ image_uri                      = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers@sha256:8592c8d71efd7e612a30f24ad884059beb7f6b7907b9761e9c4dd1e0bddd92f9" -> (known after apply)
      ~ last_modified                  = "2025-07-08T00:07:57.000+0000" -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/sbeacon-backend-updateFiles"
        name              = "/aws/lambda/sbeacon-backend-updateFiles"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "sbeacon-backend-updateFiles"
        name                  = "sbeacon-backend-updateFiles"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.aws_iam_role_policy.additional_json[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_json" {
        id          = "sbeacon-backend-updateFiles:sbeacon-backend-updateFiles"
        name        = "sbeacon-backend-updateFiles"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:ListBucket"
                      - Condition = {
                          - StringLike = {
                              - "s3:prefix" = [
                                  - "projects/*/project-files/*",
                                  - "staging/projects/*/project-files/*",
                                ]
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "arn:aws:s3:::gasi-dataportal-20250513021720562800000002"
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gasi-dataportal-20250513021720562800000002/projects/*/project-files/*"
                    },
                  - {
                      - Action   = "dynamodb:UpdateItem"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-projects",
                          - "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-clinic-jobs",
                        ]
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-vcfs"
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-clinic-jobs/index/project-name-index",
                          - "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-clinic-jobs",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-updateFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer:5",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:6",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4726607312142605307" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1742792307480419000" -> "1753950622472397000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.python_libraries_layer.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + region      = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.data.external.archive_prepare[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "archive_prepare" {
      + id      = (known after apply)
      + program = [
          + "python3",
          + ".terraform/modules/sbeacon.python_libraries_layer/package.py",
          + "prepare",
        ]
      + query   = {
          + "artifacts_dir"            = "builds"
          + "docker"                   = null
          + "hash_extra"               = null
          + "hash_extra_paths"         = jsonencode([])
          + "paths"                    = jsonencode(
                {
                  + cwd    = "/atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/232/default"
                  + module = ".terraform/modules/sbeacon.python_libraries_layer"
                  + root   = "."
                }
            )
          + "recreate_missing_package" = "true"
          + "runtime"                  = null
          + "source_path"              = "\"sbeacon/layers/python_libraries/\""
        }
      + result  = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:7" -> (known after apply)
      ~ code_sha256                 = "bucXx2mollq514qCUN8OWLFynHHG8zmuvhpDypeo+9E=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-06-06T01:33:37.497+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:7" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/d61ebf809c6ae8d34322fa26f009b6fbc76e8b7736801f02e397bd7c7737efa6.zip" -> (known after apply) # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply) # forces replacement
      ~ source_code_size            = 23772003 -> (known after apply)
      ~ version                     = "7" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gasi-lambda-layers-20250513021721893000000003/builds/d61ebf809c6ae8d34322fa26f009b6fbc76e8b7736801f02e397bd7c7737efa6.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "97aaadf252307f54278144a4b60b7fc8-5" -> (known after apply)
      ~ id                            = "builds/d61ebf809c6ae8d34322fa26f009b6fbc76e8b7736801f02e397bd7c7737efa6.zip" -> (known after apply)
      ~ key                           = "builds/d61ebf809c6ae8d34322fa26f009b6fbc76e8b7736801f02e397bd7c7737efa6.zip" -> (known after apply) # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/d61ebf809c6ae8d34322fa26f009b6fbc76e8b7736801f02e397bd7c7737efa6.zip" -> (known after apply)
      - tags                          = {
          - "Environment" = "dev"
        } -> null
      ~ tags_all                      = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = (known after apply)
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "374751970437344833" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/d61ebf809c6ae8d34322fa26f009b6fbc76e8b7736801f02e397bd7c7737efa6.zip" -> (known after apply)
          ~ "timestamp" = "1748564797630948000" -> (known after apply)
        }
    }

  # module.sbeacon.module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:6" -> (known after apply)
      ~ code_sha256                 = "Evw64LLAR3n8v4A/KY04JNPA83DunEwW3008m5p9zlY=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-07-07T23:55:08.431+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:6" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/c1f1c7339444c3895bc9e49b35a126d964dbb559af7dd4a3144a5b4d9570ef96.zip" -> "builds/4c315004379bc7b28fa3165b66f146aa420fdd3e315091c8ecbbe1d98a5019e5.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 38676 -> (known after apply)
      ~ version                     = "6" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gasi-lambda-layers-20250513021721893000000003/builds/c1f1c7339444c3895bc9e49b35a126d964dbb559af7dd4a3144a5b4d9570ef96.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "78643a464496dc43ea652aeb50281cb6" -> (known after apply)
      ~ id                            = "builds/c1f1c7339444c3895bc9e49b35a126d964dbb559af7dd4a3144a5b4d9570ef96.zip" -> (known after apply)
      ~ key                           = "builds/c1f1c7339444c3895bc9e49b35a126d964dbb559af7dd4a3144a5b4d9570ef96.zip" -> "builds/4c315004379bc7b28fa3165b66f146aa420fdd3e315091c8ecbbe1d98a5019e5.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/c1f1c7339444c3895bc9e49b35a126d964dbb559af7dd4a3144a5b4d9570ef96.zip" -> "builds/4c315004379bc7b28fa3165b66f146aa420fdd3e315091c8ecbbe1d98a5019e5.zip"
      - tags                          = {
          - "Environment" = "dev"
        } -> null
      ~ tags_all                      = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/4c315004379bc7b28fa3165b66f146aa420fdd3e315091c8ecbbe1d98a5019e5.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/4c315004379bc7b28fa3165b66f146aa420fdd3e315091c8ecbbe1d98a5019e5.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8877497894102220430" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/c1f1c7339444c3895bc9e49b35a126d964dbb559af7dd4a3144a5b4d9570ef96.zip" -> "builds/4c315004379bc7b28fa3165b66f146aa420fdd3e315091c8ecbbe1d98a5019e5.zip"
          ~ "timestamp" = "1751848838812489000" -> "1753950621867153800"
        }
    }

  # module.security.module.lambda-sendSecurityAlert.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/security-sendSecurityAlert"
        name              = "/aws/lambda/security-sendSecurityAlert"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "security-infrastructure"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.security.module.lambda-sendSecurityAlert.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "security-sendSecurityAlert"
        name                  = "security-sendSecurityAlert"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "security-infrastructure"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.security.module.lambda-sendSecurityAlert.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "security-sendSecurityAlert"
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "security-infrastructure"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6350418043603800949" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1746404502978160000" -> "1753950622520400000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "4bb010fb01e1a570bd66b210eb4e05bf9cf8e5a5"
        }

      + build {
          + cache_from     = []
          + context        = "svep/lambda/pluginConsequence"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:a09121ea5cc60b116444f06c52c03960523de82571f992c007b6b8763730d028" -> (known after apply)
        name                 = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      ~ sha256_digest        = "sha256:a09121ea5cc60b116444f06c52c03960523de82571f992c007b6b8763730d028" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "96bb1c0de7ffd40000787b7a7f56522d1f401bf4" -> "4bb010fb01e1a570bd66b210eb4e05bf9cf8e5a5"
        }
        # (2 unchanged attributes hidden)
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "7d3e0575226be2d22ae84c7fc004da03027b6693"
        }

      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "svep/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "svep/lambda/qcFigures"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:feb3aa803956a99f9b81498690950eb4e8d4205b46e58bf15cfdd55d1de52431" -> (known after apply)
        name                 = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      ~ sha256_digest        = "sha256:feb3aa803956a99f9b81498690950eb4e8d4205b46e58bf15cfdd55d1de52431" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "9542ea12e2a927dfb04a84962571da517ac56535" -> "7d3e0575226be2d22ae84c7fc004da03027b6693"
        }
        # (2 unchanged attributes hidden)
    }

  # module.svep[0].module.lambda-batchStarter.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.svep[0].module.lambda-batchStarter.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/svep-backend-batchStarter"
      + name_prefix       = (known after apply)
      + region            = "ap-southeast-3"
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all          = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.svep[0].module.lambda-batchStarter.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-batchStarter"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-batchStarter.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "svep-backend-batchStarter-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-batchStarter"
    }

  # module.svep[0].module.lambda-batchStarter.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "svep-backend-batchStarter-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-batchStarter"
    }

  # module.svep[0].module.lambda-batchStarter.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Scheduler for sVEP batch submissions"
      + filename                       = "builds/b030658b75389390c47d5caf79154ea6d13e9484ce2ebf4038fca1eddda3fdd8.zip"
      + function_name                  = "svep-backend-batchStarter"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1792
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "uat"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "uat"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 28
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-batchStarter.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/batchStarter",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/b030658b75389390c47d5caf79154ea6d13e9484ce2ebf4038fca1eddda3fdd8.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/b030658b75389390c47d5caf79154ea6d13e9484ce2ebf4038fca1eddda3fdd8.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-batchStarter.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/b030658b75389390c47d5caf79154ea6d13e9484ce2ebf4038fca1eddda3fdd8.zip"
          + "timestamp" = "1753950632549648000"
        }
    }

  # module.svep[0].module.lambda-batchSubmit.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.svep[0].module.lambda-batchSubmit.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/svep-backend-batchSubmit"
      + name_prefix       = (known after apply)
      + region            = "ap-southeast-3"
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all          = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.svep[0].module.lambda-batchSubmit.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-batchSubmit"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-batchSubmit.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "svep-backend-batchSubmit-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-batchSubmit"
    }

  # module.svep[0].module.lambda-batchSubmit.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "svep-backend-batchSubmit-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-batchSubmit"
    }

  # module.svep[0].module.lambda-batchSubmit.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Batch submission of sVEP jobs"
      + filename                       = "builds/f2196129bfbee99ecf4aca7f82dcf5aab08821f9add856de80b9801d4f700067.zip"
      + function_name                  = "svep-backend-batchSubmit"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1792
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "uat"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "uat"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 28
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-batchSubmit.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/batchSubmit",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/f2196129bfbee99ecf4aca7f82dcf5aab08821f9add856de80b9801d4f700067.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/f2196129bfbee99ecf4aca7f82dcf5aab08821f9add856de80b9801d4f700067.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-batchSubmit.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/f2196129bfbee99ecf4aca7f82dcf5aab08821f9add856de80b9801d4f700067.zip"
          + "timestamp" = "1753950633365527000"
        }
    }

  # module.svep[0].module.lambda-clearTempAndRegions.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/svep-backend-clearTempAndRegions"
        name              = "/aws/lambda/svep-backend-clearTempAndRegions"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.svep[0].module.lambda-clearTempAndRegions.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "svep-backend-clearTempAndRegions"
        name                  = "svep-backend-clearTempAndRegions"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-clearTempAndRegions.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "svep-backend-clearTempAndRegions:svep-backend-clearTempAndRegions-0"
        name        = "svep-backend-clearTempAndRegions-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-sendJobEmail",
                          - "arn:aws:s3:::svep-backend-temp-20250513021715904000000001",
                          - "arn:aws:s3:::svep-backend-regions-20250513021716040900000002",
                        ]
                    },
                  - {
                      - Action   = "s3:DeleteObject"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::svep-backend-temp-20250513021715904000000001/*",
                          - "arn:aws:s3:::svep-backend-regions-20250513021716040900000002/*",
                        ]
                    },
                  - {
                      - Action   = [
                          - "dynamodb:ListStreams",
                          - "dynamodb:GetShardIterator",
                          - "dynamodb:GetRecords",
                          - "dynamodb:DescribeS
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.